---
kind: method
id: M:Autodesk.Revit.DB.GroupSet.Contains(Autodesk.Revit.DB.Group)
source: html/61b3b8ff-4187-ace5-80d6-635118e8635a.htm
---
# Autodesk.Revit.DB.GroupSet.Contains Method

Tests for the existence of a group within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	Group item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Group`) - The group to be searched for.

## Returns
The Contains method returns True if the group is within the set, otherwise False.